# Team 8
## Team Challenge SQL Murder

In [5]:
import pandas as pd
import sqlite3

In [6]:
conn = sqlite3.connect("data/sql-murder-mystery.db")

In [7]:
def sql(query):
    return pd.read_sql_query(query, conn)

In [8]:
consulta_1 = '''
SELECT *
FROM crime_scene_report
WHERE type = 'murder'
  AND date = '20180115'
  AND city = 'SQL City';
  '''
pd.read_sql_query(consulta_1, conn)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".

In [19]:
consulta_2 = '''
SELECT *
FROM person as per
LEFT JOIN interview as inter
ON per.id = inter.person_id
WHERE address_street_name  = 'Northwestern Dr'
ORDER BY address_number desc
limit 1
'''
pd.read_sql_query(consulta_2, conn)

,id,name,license_id,address_number,address_street_name,ssn,person_id,transcript
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949,14887,I heard a gunshot and then saw a man run out. ...

In [10]:
pd.read_sql_query(consulta_2, conn) ["transcript"][0]

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

In [11]:
consulta_3 = '''
SELECT *
FROM person as per
LEFT JOIN interview as inter
ON per.id = inter.person_id
WHERE address_street_name  = 'Franklin Ave'
AND name like 'Annabel%'
'''

pd.read_sql_query(consulta_3, conn)

,id,name,license_id,address_number,address_street_name,ssn,person_id,transcript
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143,16371,"I saw the murder happen, and I recognized the ..."

In [12]:
pd.read_sql_query(consulta_3, conn) ["transcript"][0]

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

In [13]:
consulta_4 = '''
Select * 
FROM get_fit_now_member gfnm 
LEFT JOIN get_fit_now_check_in gfnci 
ON gfnm.id = gfnci.membership_id
WHERE
gfnm.membership_status = 'gold'
AND
gfnci.membership_id like '48Z%'
AND
gfnci.check_in_date = '20180109'
'''

pd.read_sql_query(consulta_4, conn)

,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time
0,48Z7A,28819,Joe Germuska,20160305,gold,48Z7A,20180109,1600,1730
1,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55,20180109,1530,1700

In [14]:
consulta_5 = '''
SELECT * 
FROM get_fit_now_member gfnm 
LEFT JOIN get_fit_now_check_in gfnci 
ON gfnm.id = gfnci.membership_id
LEFT JOIN person per
ON gfnm.person_id = per.id
RIGHT JOIN drivers_license dl 
ON per.license_id  = dl.id
WHERE 
gfnm.membership_status = 'gold'
AND 
gfnci.membership_id like '48Z%'
AND 
gfnci.check_in_date = '20180109'
'''

pd.read_sql_query(consulta_5, conn)

,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time,id,...,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55,20180109,1530,1700,67318,...,871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS